app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-08-17 22:51:35.561218"], ["text", "a;lsdkfjas;ldkfj"], ["title", "Blog 2"], ["updated_at", "2015-08-17 22:51:35.561218"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save